# Database Name : RSQL
# Table Nmae :score
- id, korean, english, mathematics

- Anaconda Navigator
- rJava, RMySQL설치하기

In [9]:
library(RMySQL)

In [47]:
# DB Connection

conn <- dbConnect(MySQL(),
                  dbname = "RSQL",
                  user = "root",
                  password = "qwer1234",
                  host = "127.0.0.1"
                 )

In [21]:
# 테이블 목록

dbListTables(conn)

[1] "score"

In [22]:
# table의 컬럼 목록

dbListFields(conn,'score')

[1] "id"          "korean"      "english"     "mathematics"

In [23]:
# Select

dbGetQuery(conn,'select count(*) from score')

  count(*)
1 0

In [24]:
dbGetQuery(conn,"select * from score")

     id korean english mathematics

In [25]:
# insert

dbSendQuery(conn,'insert into score values(1,100,100,100)')

result = dbGetQuery(conn,'select * from score')
result

  id korean english mathematics
1 1  100    100     100

In [26]:
dbSendQuery(conn,'insert into score values(2,90,90,90)')

result = dbGetQuery(conn,'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     90      90

In [27]:
# Update

dbSendQuery(conn,'update score set korean=90,english=80,mathematics=70 where id =2')

result = dbGetQuery(conn,'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     80      70

In [48]:
# delete

dbSendQuery(conn,'delete from score')

result = dbGetQuery(conn,'select * from score')
result

     id korean english mathematics

SHOW VARIABLES LIKE 'local_infile';   
SET GLOBAL local_infile = 1;
- 해당 문장을 sql에서 실행함으로 한번에 파일을 올릴수 있음

In [49]:
# csv file을 읽어서 MySQL에 넣기 

data <- read.csv("./Data/score.csv",header=F)
colnames(data) <- c('id','korean','english','mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [50]:
dbWriteTable(conn,"score",data,overwrite=T,row.names=F) # append = T

[1] TRUE

In [51]:
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [33]:
str(data)

'data.frame':	10 obs. of  4 variables:
 $ id         : int  1 2 3 4 5 6 7 8 9 10
 $ korean     : int  90 90 90 90 90 100 100 100 100 100
 $ english    : int  80 88 89 87 60 100 100 100 100 100
 $ mathematics: int  70 70 70 70 70 100 100 100 100 100

In [52]:
data2 <- read.csv("./Data/score2.csv",header = F)
colnames(data2) <- c('id','korean','english','mathematics')
data2

  id korean english mathematics
1 11 90     80      70
2 12 90     88      70

In [53]:
dbWriteTable(conn,"score",data2,overwrite=F,row.names=F,append=T)

[1] TRUE

In [54]:
result = dbGetQuery(conn,'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [55]:
# Disconnect

dbDisconnect(conn)

[1] TRUE